Repository: CookiesUnion/languages_cookiesunion.com
Catalog: */dev/translate/faq.po
Languages: es_es

source: # <a name="faq"></a>Cookie FAQ
es_es: # <a name="faq"></a>Cookies FAQ

source: ## <a name="what_are_cookies"></a> What are cookies?
es_es: ## <a name="what_are_cookies"></a> ¿Qué son las cookies?

source: Cookies are small text files (much like notes) which are sent to your computer, smartphone, or other device when you visit a website.
es_es: Las cookies son pequeños archivos de texto (muy pareceido a una nota) que se envían a su pc, smartphone u otro dispositivo cuando usted visita un sitio web.

source: Cookies are useful in that they help to capture the information necessary for websites to remember your device and personal preferences.
es_es: Las cookies son útiles porque ayudan a capturar la información necesaria para que los sitios web recuerden su dispositivo y sus preferencias personales.

source: > Contrary to popular belief, cookies are not a form of virus or malicious software. They are simply text notes which aids the website in adopting the correct behaviors.
es_es: > Opuestamente a la creencia popular, las cookies no son una forma de virus o software malicioso. Son simplemente notas de texto que ayudan a la página web a comportarse correctamente.

source: ## <a name="how_cookies_work"></a> How do they work?
es_es: ## <a name="how_cookies_work"></a> ¿Cómo funcionan?

source: When you visit a website, that site sends cookies to your device where they are stored temporarily.
es_es: Cuando visitas un sitio web, ese sitio envía cookies a tu dispositivo donde se almacenan temporalmente.

source: When you re-visit the site using the same device, the cookies are returned to the website, allowing it to recall important data such as individual preferences. **That's it.**
es_es: Cuando vuelves a visitar el sitio usando el mismo dispositivo, las cookies se devuelven a la página web, lo que le permite recordar datos importantes, como las preferencias individuales. **Eso es todo.**

source: Let's see an example: 1. The user visit a news website. 2. The website send today's news. 3. The user click on "I am interested in sports". 4. The website writes a cookie in the user browser: "interest: sports". 5. The user visit the website later. His browser send back the cookie (note) "interest: sports" to the website. 6. The website send today's news, but with sports at the top.
es_es: Veamos un ejemplo: 1. El usuario visita un sitio web de noticias. 2. La página web envía las noticias de hoy. 3. El usuario hace clic en "Estoy interesado en deportes". 4. La página web escribe una cookie en el navegador del usuario: "intereses: deportes". 5. El usuario visita la página web más tarde. Su navegador envía de vuelta la cookie (nota) "intereses: deportes" a la página web. 6. La página web envia las noticias de hoy, pero con los deportes en la parte superior.

source: ## <a name="why"></a> Why are cookies necessary?
es_es: ## <a name="why"></a> ¿Por qué son las cookies necesarias?

source: Cookies are useful because they help websites to remember information relevant to a user’s individual experience. This includes things such as remembering whether you are logged into your account (or not), showing you the appropriate content, language preferences, or the items placed in an online shopping cart. Without cookies, you would have to reenter this information in its entirety each time you visit a website.
es_es: Las cookies son útiles porque ayudan a sitios web a recordar información relevante para la experiencia individual de un usuario. Esto incluye usos tales como recordar si ha iniciado sesión en su cuenta (o no), mostrarte el contenido apropiado, preferencias de idioma, o los objetos colocados en un carro de compras en línea. Sin las cookies, usted tendría que volver a introducir esta información en su totalidad cada vez que visita un sitio web.

source: Cookies also help to track _anonymous_ information about visits to a website so it can be improved.
es_es: Las cookies también ayudan a recoger información _anónima_ sobre las visitas a un sitio web para que pueda ser mejorado.

source: Remember, cookies do not know your name, but the company who write them _may do_.
es_es: Recuerda, las cookies no saben tu nombre, pero la empresa que las escribe _igual si que lo sabe_.

source: ## <a name="disable"></a>How can I disable cookies?
es_es: ## <a name="disable"></a>¿Cómo puedo desactivar las cookies?

source: Every browser have their own configuration panel, but it is common to find it under "Privacy" or "Content settings". For more detailed instructions:
es_es: Cada navegador tiene su propio panel de configuración, pero es común encontrarlo en la sección de "Privacidad" o "Configuración de contenido". Para ver instrucciones más detalladas:

source: You know what you are doing. Some websites may behave incorrectly and a lot of them will stop working. And remeber, cookie notices *everywhere*.
es_es: Tu sabes lo que estás haciendo. Algunos sitios web pueden comportarse de forma incorrecta y muchos de ellos dejarán de funcionar. Y recuerda, avisos de cookies **por todas partes**.

source: Modern browsers such as Google Chrome allow cookie restriction by domain. You could find that method more usefull than disable cookie support completely.
es_es: Navegadores modernos como Google Chrome permiten restricción de cookies por dominio. Puedes encontrar este método más útil que desactivar las cookies por completo.

source: ## <a name="law"></a> What is the EU Cookie Law?
es_es: ## <a name="law"></a> ¿Qué es la Ley de cookies de la Unión Europea?

source: Cookie law is the commonly used term that refers to the [Directive 2002/58 on Privacy and Electronic Communications](http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX:32002L0058:en:HTML) known as E-Privacy Directive, wich sets general requirements about privacy and data protection for the electronic and communications sector in the European Union.
es_es: Ley de cookies es el término comúnmente utilizado para referirse a la [Directiva 2002/58 sobre privacidad y comunicaciones electrónicas](http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX:32002L0058:en:HTML) conocida como Directiva sobre privacidad Europea, que establece requisitos generales acerca de la privacidad y protección de datos para el sector de la electrónica y de las comunicaciones en la Unión Europea.

source: ## <a name="bad"></a> So cookies are not bad?
es_es: ## <a name="bad"></a> ¿Así que las cookies no son malas?

source: #### As described before, cookies are just a way to store information. How websites use them are another matter.
es_es: #### Como se ha descrito antes, las cookies son sólo una manera de almacenar información. Como utilizan los sitios web esa información es otro tema.

source: For example, social networks have personal information and therefore cookies set by them can leave some information about you or about your actions, profiles you visit, things you share, etc. But that is not a problem with cookies, you also leave a tail of accesed url's (unless you use a ssl vpn), or the images cached (automatically downloaded and stored without your permission in your browser).
es_es: Por ejemplo, las redes sociales tienen información personal y por lo tanto cookies escritas por ellos pueden dejar rastros acerca de ti o acerca de tus acciones, los perfiles que visitas, cosas que compartes, etc. Pero eso no es un problema con las cookies, tu también dejas un rastro de URL a las que has accedido (a menos que utilices un VPN SSL), o las imágenes en caché (descargados y almacenadas sin tu permiso en tu navegador de forma automática).

source: Here, the power to do evil is in the social network, the website owner. Only they can configure their websites to be more secure (use https://), to not write cookies with personal information inside, and enable technologies and policies to protect your privacy. That is why the never-readed-by-most-users "Terms and conditions" are so important. In most of them you **consent** the usage of you data.
es_es: Aquí, el poder para hacer el mal está en la red social, el propietario del sitio web. Sólo ellos pueden configurar sus sitios web para que sean más seguros (usando https://), no escribir cookies con información personal en su interior, y habilitar tecnologías y políticas para proteger tu privacidad. Esta es la razón por la que los nunca-leidos-por-la-mayoría "Términos y condiciones" son tan importantes. En la mayoría de ellos tu **consientes** el uso de tus datos.

source: _They can't do wrong <u>unless you give them</u> the tools._ The first choice is yours.
es_es: _Ellos no pueden hacer el mal <u>a menos que les des las herramientas</u>._ La primera elección es tuya.

source: **If you visit a website about news and they ask you to use cookies, well you have not given them any personal data right? Even if they wanted to, what could they do?**
es_es: **Si visitas un sitio web de noticias y te piden usar cookies, bueno, ¿no les ha dado ningún dato personal verdad? Incluso si quisieran, ¿qué podían hacer?**

source: In the same way a website that have all kind of information about you but claim not to use cookies is _no good_ either.
es_es: De la misma forma un sitio web que tiene todo tipo de información sobre ti, pero afirma no usar cookies no es tampoco _bueno_.

source: ## <a name="abroad"></a> I don't live in the European Union. Am I affected?
es_es: ## <a name="abroad"></a> Yo no vivo en la Unión Europea. ¿Me afecta?

source: #### These notices and alerts will also be shown to you.
es_es: #### Estos avisos y alertas también te aparecerán a ti.

source: The law affect websites in the EU, or targeted in the EU, so certain non-eu based websites should also inform their users and ask for permission.
es_es: La ley afecta a los sitios web de la UE, o dirigidos a la UE, por lo que algunos sitios web no comunitarios ​​también deben informar a sus usuarios y pedir permiso.
