Repository: CookiesUnion/languages_cookiesunion.com
Catalog: */dev/translate/integrate.po
Languages: es_es

source: # <a name="how"></a> How can I use it in my website? Simply include the file `http://cookiesunion.com/cookiesunion.js` in your website like so:
es_es: # <a name="how"></a> ¿Cómo lo puedo usar en mi sitio Web? Sólo tiene que incluir el archivo `http://cookiesunion.com/cookiesunion.js` en su sitio web, por ejemplo:

source: ```html <!DOCTYPE html> <html> <head> <title>My Page</title> <script src="http://cookiesunion.com/cookiesunion.js"></script> </head> <body> ```
es_es: ```html <!DOCTYPE html> <html> <head> <title>Mi página</title> <script src="http://cookiesunion.com/cookiesunion.js"></script> </head> <body> ```

source: **And that's it! The cookie notice will automatically be shown to your visitors.**
es_es: **¡Y eso es todo! La notificación sobre cookies se mostrará automáticamente a sus usuarios.**

source: The message includes a "Learn More" link to `http://cookiesunion.com/info/?site=example.com` where `example.com` is replaced by your own domain, so visitors can see detailed information and [FAQ](/info/#faq) about cookies. This way you comply with the [cookie law](/info/#law) completely, and you can finally forget about it.
es_es: El mensaje incluye un enlace "Más información" que dirige a `http://cookiesunion.com/info/?site=example.com` donde `example.com` se sustituye por tu propio dominio, por lo que los visitantes pueden ver información detallada y [Preguntas frequentes](/info/#faq) sobre las cookies. De esta manera se cumple con la [ley de cookies](/info/#law) por completo, y puedes finalmente olvidarte del asunto.

source: # <a name="parameters"></a> Script parameters
es_es: # <a name="parameters"></a> Los parámetros del script

source: Script parameters can be set at the end of the include url like so: `http://cookiesunion.com/cookiesunion.js?autorun=false`
es_es: Los parámetros se pueden establecer al final de la url de la siguiente manera: `http://cookiesunion.com/cookiesunion.js?autorun=false`

source: * <a name="autorun"></a>**autorun**: [boolean] - Whether or not the script should start as soon as the page is loaded. (default: true) Useful in conjuction with the [run method](#method_run) or [check method](#method_check), if you don't want the script to run every time and call it manually (for example run only for visitors of `example.com/page-with-cookies` and not for `example.com/page-without-cookies`)
es_es: * <a name="autorun"></a>**autorun**: [boolean] - Indica si el script debe comenzar tan pronto como se carge la página. (por defecto: true) Útil en conjunto con el [método run](#method_run) o el [método check](#method_check), si no quieres que el script se ejecute cada vez y lanzarlo de forma manual (por ejemplo lanzarlo sólo para los visitantes de `example.com/página-con-cookies` y no para `example.com/página-sin-cookies`)

source: # <a name="options"></a> Script options
es_es: # <a name="options"></a> Opciones del script

source: These options can be set in javascript as the properties of an object passed as first argument to the `CookiesUnion()` constructor.
es_es: Estas opciones se pueden establecer en javascript como las propiedades de un objeto pasado como primer argumento al constructor `CookiesUnion()`.

source: ```javascript var instance = CookiesUnion({ domain: 'sitedomain.com', language: 'en' }); ```
es_es: ```javascript var instance = CookiesUnion({ domain: 'dominiodelsitio.com', language: 'en' }); ```

source: * **domain**: [string] - Domain where to save the "cookie preference" cookie. (default: _-current domain-_) Can only be a parent, higher level domain of the website subdomain. It is used so you can share the script between subdomains. If you run `site-a.example.com` and `site-b.example.com` this will be `example.com`. You might find useful to ask visitors only once and use that preference in the other subdomains. Note that it is not posible to do this between diferent domains like `example-a.com` and `example-b.com` because browser security features (You can not write or read cookies from diferent domains).
es_es: * **domain**: [string] - Dominio dónde guardar la cookie de preferencia sobre cookies. (por defecto: _-dominio actual-_) Sólo puede ser un dominio padre, de nivel superior al subdominio de la página web. Se utiliza para que se pueda compartir el script entre subdominios. Si tienes `site-a.example.com` y `site-b.example.com` sería `example.com`. Puedes encontrarlo útil para preguntar a los usuarios una sola vez y usar la preferencia en los otros subdominios. Ten en cuenta que es imposible hacerlo entre dominios diferentes como `ejemplo-a.com` y `ejemplo-b.com` dado las características de seguridad del navegador (No se puede escribir ni leer cookies de dominios diferentes).

source: * **language**: [string | array] - Code or list of language codes like "en","es" or "fr". (default: _-browser language preference-_) The script will search available languages for the notice and match the first available in this list. If none is found then "en" (English) will be used.
es_es: * **language**: [string | array] - Código o lista de códigos de idioma como "en", "es" o "fr". (por defecto: _-preferencia de idioma del navegador-_) El script buscará idiomas disponibles para la notificación con el primero que coincida de esta lista. Si no se encuentra ninguno entonces "en" (Inglés) será utilizado.

source: * **availableLanguages**: [object] - Array of text messages for the notice (default: _-translations in "en" and "es"-_) The object keys are treated as language codes, and their values are another object with three properties, `info` (cookie usage message), `learnMore` (link text for more info) and `join` (join CookiesUnion info message), whose values are the text that would be displayed.
es_es: * **availableLanguages**: [object] - Lista de textos para los mensajes de la alerta (por defecto: _-traducciones en "en" y "es"-_) Las propiedades del objeto se tratan como los códigos de idioma y sus valores son otro objeto con tres propiedades, `info` (mensaje de uso de cookies), `learnMore` (texto del enlace para obtener más información) y `join` (mensajes de información para unirse a CookiesUnion), cuyos valores son el texto que se mostrará.

source: * **classPrefix**: [string] - Prefix used in the html class name of the notice. (default: "_cookiesunion") Class name of the html notice will be formed by this prefix and a integrer with auto increment starting from 0, so by default the class of the first notice will be `_cookiesunion _cookiesunion-0`. Makes possible for you to css match all the notices (with `._cookiesunion`) or just one of them (with `._cookiesunion-0`). For example you could use: `div._cookiesunion { background-color: white; }` to override default background color (note that in order to give more priority to your css rule and override default style you should use `div._classname_` or `!important` rule).
es_es: * **classPrefix**: [string] - Prefijo utilizado en el nombre de la clase html de la notificación. (por defecto: "_cookiesunion") La clase de la notificación html estará formada por este prefijo y un numero con incremento automático a partir de 0, siendo la clase de la primera notificación `_cookiesunion _cookiesunion-0`. Hace posible seleccionar por css todas las notificaciones (con `._cookiesunion`) o sólo una de ellas (con` ._cookiesunion-0`). Por ejemplo, se puede usar: `div._cookiesunion { background-color: white; }` para reemplazar el color de fondo por defecto (ten en cuenta que con el fin de dar más prioridad a la regla css y anular el estilo por defecto es obligatorio usar la regla `div._classname_` o `!important`).

source: * **cookieName**: [string] - Name of the cookie set when the user accept cookie usage in the site (default: "\_cookies-informed") A cookie with this name is set when the user accept cookie usage in your site. If found, the script will not check CookiesUnion.com user preference and auto hide the notice. Changing this is useful only when you have a restriction on cookie names, for example because a policy in your company that forces all cookies to be named "companyname_cookiename".
es_es: * **cookieName**: [string] - Nombre de la cookie guardada cuando el usuario acepta el uso de cookies en el sitio (por defecto: "\_cookies-informed") Una cookie con este nombre se establecerá cuando el usuario acepte el uso de cookies en tu sitio. Si se encuentra, el script no comprobará la preferencia del usuario en CookiesUnion.com y ocultará la alerta automáticamente. Cambiar esto es útil sólo cuando se tiene una restricción de nombres de cookies, por ejemplo debido a una política en su compañía, que oblige a todas las cookies llamarse "companyname_cookiename".

source: * **cookieValue**: [string] - Value of the cookie (default: "yes") Same as cookieName, but for the cookie value. Not really important.
es_es: * **cookieValue**: [string] - Valor de la cookie (por defecto: "yes") Igual que cookieName, pero para el valor de la cookie. No es realmente importante.

source: * **memberCheck**: [boolean] - Whether or not the script should check if the visitor is member of CookiesUnion.com and accept the use of cookies (default: true) The script first check for a local `_cookies-informed` cookie, then only if not found and memberCheck is set to true it will check CookiesUnion.com global cookie preference. Set to false so the CookiesUnion.com user preference of auto-accept cookie usage is ignored, converting the script in a regular cookie notice, independent of other websites, checking only the site `_cookies-informed` cookie.
es_es: * **memberCheck**: [boolean] - Indica si el script debe comprobar si el visitante es miembro de CookiesUnion.com y aceptar el uso de cookies (por defecto: true) El script primero comprueba si existe una cookie local `_cookies-informed`, y sólo en el caso de que no se encuentre y memberCheck este establecido en true comprobará la preferencia global del usuario en CookiesUnion.com. Establecelo en false para ignorar la preferencia sobre el uso de cookies del usuario en CookiesUnion.com, convirtiendo el script en una notificación de cookies normal, independiente de otros sitios web, comprobando sólo la cookie `_cookies-informed`.

source: * **life**: [integer] - Life of the cookie in seconds. (default: 10\*365\*24\*60\*60 _-10 Years-_) Indicates the lifetime of the cookie preference. It will expire when this time has passed since the user accept the use of cookies, and the notice will inform the user again.
es_es: * **life**: [integer] - La vida de la cookie en segundos. (Por defecto: 10\*365\*24\*60\*60 _-10 Años -_) Indica el tiempo de vida de la preferencia sobre cookies. Expirará cuando haya pasado este tiempo desde que el usuario aceptó el uso de cookies, e informará al usuario de nuevo.

source: # <a name="methods"></a> Script main methods
es_es: # <a name="methods"></a> Métodos principales del script

source: As described in [Script options](#options) the constructor `CookiesUnion(options);` accept an object of options, and in turn, will return a configured instance as an object with the following methods:
es_es: Como se describe en [opciones del script](#options), el constructor `CookiesUnion(opciones);` acepta un objeto de opciones, y a su vez, devuelve una instancia configurada como un objeto con los siguientes métodos:

source: * <a name="method_run"></a>**run**( callback\_function( _boolean, [notice\_object](#notice_methods)_ ) ); By default with [`autorun = true`](#autorun) the script will launch this method as soon as the page load. Check if cookie usage is accepted and create the html notice if necesary. It will treat the method argument as a function callback, and will call that function with two arguments: 1. A boolean indicating if cookie usage already accepted. 2. In case cookie usage is not accepted and the html notice is shown, then return the [`notice`](#notice_methods) object, null otherwise. Usage example (disabling autorun first with parameter [`autorun = false`](#autorun), else, we would have two notices):
es_es: * <a name="method_run"></a>**run**( callback\_function( _boolean, [notice\_object](#notice_methods)_ ) ); Por defecto con [`autorun = true`](#autorun) el script lanzará este método tan pronto como la página se cargue. Revisa si se ha aceptado el uso de cookies y crea la notificación html si es necesario. Trata el argumento del método como una función, y la invoca con dos argumentos: 1. Un boolean que indica si se aceptado el uso de cookies. 2. En el caso que no se haya aceptado el uso de cookies y se muestre la notificación html, devuelve el objeto [`notice`](#notice_methods), de lo contrario devuelve null. Ejemplo de uso (deshabilitar la ejecución automática en primer lugar con el parámetro [`autorun = false`](#autorun), de lo contrario, tendríamos dos notificaciones):

source: ```javascript var instance = CookiesUnion({ language: 'en' }); instance.notice(function(accepted, notice) { alert('Html notice is already showing if necesary'); if (accepted) { alert('The user already accepted cookie usage.'); // notice is null } else { alert('The user have not accepted cookie usage yet.'); // notice is a object alert('We close the notice programatically'); notice.close(); } }); ```
es_es: ```javascript var instance = CookiesUnion({ language: 'en' }); instance.notice(function(accepted, notice) { alert('La notificación html ya se ha mostrado si es necesario'); if (accepted) { alert('El usuario ya ha aceptado el uso de cookies.'); // notice is null } else { alert('El usuario todavía no ha aceptado el uso de cookies'); // notice is a object alert('Cerramos la noticia automaticamente'); notice.close(); } }); ```

source: * <a name="method_check"></a>**check**( callback\_function( _boolean, createNotice\_function_ ) ); Check if user accepted the cookie usage. It will treat the method argument as a function callback, and will call that function with two arguments: 1. A boolean indicating if cookie usage is already accepted. 2. A function you should call to create a notice. Works the same as the [`run`](#method_run) method, but does not create the html notice by default. It is useful when you want to integrate with existing code or modify behaviour based on the user choice. Usage example (with parameter [`autorun = false`](#autorun)):
es_es: * <a name="method_check"></a>**check**( callback\_function( _boolean, createNotice\_function_ ) ); Revisa si el usuario acepta el uso de cookies. Trata el argumento del método como una función, y la invoca con dos argumentos: 1. Un boolean que indica si se ha aceptado el uso de cookies. 2. Una función la cual se puede invocar para crear la notificación. Funciona igual que el método [`run`](#method_run), pero no crea la notificación html por defecto. Es útil cuando se desea integrar con el código existente o modificar el comportamiento basado en la elección del usuario. Ejemplo de uso (con el parámetro [`autorun = false`](#autorun)):

source: ```javascript var instance = CookiesUnion(); instance.check(function(accepted, createNotice) { if (accepted) { alert('The user already accepted cookie usage'); } else { alert('The user have not accepted cookie usage yet'); // Logic example alert('We fire the notice programatically'); notice = createNotice(); alert('We close the notice programatically'); notice.close(); } }); ```
es_es: ```javascript var instance = CookiesUnion(); instance.check(function(accepted, createNotice) { if (accepted) { alert('El usuario ya ha aceptado el uso de cookies'); } else { alert('El usuario todavía no ha aceptado el uso de cookies'); // Ejemplo alert('Lanzamos la notificación automáticamente'); notice = createNotice(); alert('Cerramos la notificación automáticamente'); notice.close(); } }); ```

source: * <a name="method_forcenotice"></a>**forceNotice**( callback\_function( _[notice\_object](#notice_methods)_ ) ); Force show the notice, even when already accepted. Usage example:
es_es: * <a name="method_forcenotice"></a>**forceNotice**( callback\_function( _[notice\_object](#notice_methods)_ ) ); Fuerza mostrar la notificación, incluso cuando ya esta aceptada. Ejemplo de uso:

source: ```javascript var instance = CookiesUnion(); instance.forceNotice(function(notice) { alert('The notice is always showing, even after accepting it!'); }); ```
es_es: ```javascript var instance = CookiesUnion(); instance.forceNotice(function(notice) { alert('¡La notificación se muestra siempre, incluso después de aceptarla!'); }); ```

source: # <a name="notice_methods"></a> `notice` object methods
es_es: # <a name="notice_methods"></a> Métodos del objeto `notice`

source: The `notice` object have the following methods so you can interact with the associated notice html showing at the top of your website.
es_es: El objeto `notice` tiene los siguientes métodos para poder interactuar con la notificación html asociada que se muestra en la parte superior de la página web.

source: * <a name="notice_method_open"></a>**open**() Show a closed notice again.
es_es: * <a name="notice_method_open"></a>**open**() Mostrar de nuevo una notificación cerrada.

source: * <a name="notice_method_close"></a>**close**() Close the notice.
es_es: * <a name="notice_method_close"></a>**close**() Cerrar la notificación.

source: * <a name="notice_method_accept"></a>**accept**() Have the same effect as the user actually closing and accepting the cookie usage notice. As this is a user choice you should not call this method automatically on behalf of your visitor, but it can be of help if you already know the user preference by other means (example: visitor already accepted terms and conditions that include cookie usage details). Usage example:
es_es: * <a name="notice_method_accept"></a>**accept**() Tiene el mismo efecto que el usuario cerrando y aceptando la notificación del uso de cookies. Como se trata de una decisión del usuario no se debe invocar este método de forma automática en nombre del usuario, pero puede ser de ayuda si ya se conoce la preferencia del usuario por otros medios (por ejemplo: el usuario ha aceptado términos y condiciones que incluyen uso de cookies). Ejemplo de uso:

source: ```javascript var instance = CookiesUnion(); instance.notice(function(accepted, notice) { alert('Html notice is already showing if necesary'); if (accepted) { alert('The user already accepted cookie usage. Do nothing'); } else { alert('The user have not accepted cookie usage yet.'); // check preference by other means, for example: if (visitorAlreadyAcceptedCookiesOnTermsAndConditions) { notice.accept(); } } }); ```
es_es: ```javascript var instance = CookiesUnion(); instance.notice(function(accepted, notice) { alert('Alerta html ya esta siendo mostrada si es necesario'); if (accepted) { alert('El usuario ya ha aceptado el uso de cookies. No hacer nada'); } else { alert('El usuario todavía no ha aceptado el uso de cookies.'); // comprueba preferencia del usuario por otros métodos, por ejemplo: if (usuarioYaHaAceptadoUsoDeCookiesEnTerminosYCondiciones) { notice.accept(); } } }); ```
