Repository: CookiesUnion/languages_cookiesunion.com
Catalog: */dev/cookiesunion.po
Languages: es_es

source: Error 403: Forbidden.
es_es: Error 403: Prohibido.

source: You don't have access to "%s"
es_es: Usted no tiene acceso a "%s"

source: Error 404: Page Not Found.
es_es: Error 404: Página no encontrada.

source: The page "%s" do not exist.
es_es: La página "%s" no existe.

source: Please do not hotlink files.
es_es: Por favor, no enlace archivos directamente.

source: Error 400: Bad Request.
es_es: Error 400: Solicitud incorrecta.

source: Server could not understand current request.
es_es: El servidor no ha entendido la petición actual.

source: Back
es_es: Atrás

source: This is a live example of the information page about cookies.
es_es: Este es un ejemplo de la página de información sobre cookies.

source: You can use it by linking to <code>http://cookiesunion.com/info/?site=<strong>yoursite.domain</strong></code> or <a href="/integrate/">including cookiesunion.js</a> in your website.
es_es: Puedes utilizarla enlazando a <code>http://cookiesunion.com/info/?site=<strong>yoursite.domain</strong></code> o <a href="/integrate/">incluyendo cookiesunion.js</a> en tu sitio web.

source: If you are aware about cookies, and want websites to use cookies without asking any more...
es_es: Si tienes conocimiento acerca de las cookies, y deseas que los sitios web utilizen cookies sin preguntar mas veces...

source: Please do not ask anymore
es_es: Por favor no me pregunten mas

source: Click here to accept the use of cookies and not be asked again:
es_es: Haz click aquí para aceptar el uso de cookies y no ser preguntado de nuevo:

source: I want cookies!
es_es: ¡Quiero cookies!

source: From now on you will not be asked about cookies on sites that are members of CookiesUnion.com
es_es: A partir de ahora no serás preguntado acerca de cookies en los sitios web miembros de CookiesUnion.com

source: Please ask again
es_es: Por favor, vuelve a preguntar

source: Revert
es_es: Revertir

source: Remeber that this preference is saved in this browser, so if you change of browser or use another device you should join again visiting this same page.
es_es: Recuerde que esta preferencia se guarda en este navegador, por lo que si cambias de navegador o utilizas otro dispositivo debes unirte de nuevo visitando esta misma página.

source: Send it to your other devices and share with your friends
es_es: Envíalo a tus otros dispositivos y compartelo con tus amigos

source: I am a member of CookiesUnion.com
es_es: Soy miembro de CookiesUnion.com

source: Contact with us
es_es: Contacte con nosotros

source: You got a question?
es_es: ¿Tienes una pregunta?

source: Send us a message now!
es_es: ¡Envíenos un mensaje ahora!

source: Send us a message
es_es: Envíenos un mensaje
